% Определение передаточной функции 
s = tf('s');
sys_1 = ((s-3.49)*(s+0.79))/((s-0.33)*(s-0.46)*(s+2.36)*(s+2)*(s-0.15));

sys_2 = (s-3.94)/((s+1.04)*(s+0.34)*(s+1.9)*(s+1.38)*(s+0.67));

sys_3 = ((s+3.09)*(s+1.47)*(s+2.17)*(s+0.86)*(s+1.13))/((s-1.01)*(s-0.67)*(s+0.34)*(s+3.97)*(s-0.24));

k = 1;
w_1 = k * (s-3)/(s^2+7*s+4);
w_2 = k * (100*s^2+40*s+4)/(100*s^3-15*s^2-8*s-0.6);

sys = w_1;

figure(1) 
pzmap(sys) 
title('График полюсов и нулей разомкнутой системы') 



figure(2) 
sysc = feedback(sys,1); 
pzmap(sysc) 
title('График полюсов и нулей замкнутой системы') 

sys_1;